# Pandas
# library used to read strcutured data and we can manipulate the data lEx.csv,excel,sql table,json

# Pandas is a Python library used for working with data sets.

# It has functions for analyzing, cleaning, exploring, and manipulating data.

In [59]:
import pandas as pd

# used to read file and make it as data frame
df2=pd.read_csv("titanic.csv")

In [60]:
df2

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [61]:
df2.head()
# for first 5 values

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [63]:
df2.tail()
# last 5 values

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# series is one dimesional array like list

In [7]:
a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [13]:
# if we dont give any index in series means then it l automatically sets to 0,1,2 as index ,
# if we want to set specific then use index argument

In [12]:
myvar1 = pd.Series(a,index=[1,2,3])
myvar1

1    1
2    7
3    2
dtype: int64

# DataFrames
Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

In [25]:
# ex:1

data={
    "name":["a","b","c"],
    "job":["data scientist","developer","tester"],
    "rank":["A","B","C"],
    
}

# print(type(data))

df=pd.DataFrame(data)
print(df)

  name             job rank
0    a  data scientist    A
1    b       developer    B
2    c          tester    C

In [43]:

# how to access rows


# how to store dataframe in local as csv file
# inbuild functions

# how to access columns

In [26]:
df

  name             job rank
0    a  data scientist    A
1    b       developer    B
2    c          tester    C

In [27]:
# if i want name column only then


df["name"]

0    a
1    b
2    c
Name: name, dtype: object

In [28]:
# if i want multiple column then we can get like below
df[["name","rank"]]

  name rank
0    a    A
1    b    B
2    c    C

In [29]:
# but type of df["name"] and type of df[["name","rank"]] will differ
type(df["name"])

pandas.core.series.Series

In [30]:
type(df[["name","rank"]])

pandas.core.frame.DataFrame

# how to list all columns

In [41]:
l=df.columns
l

Index(['name', 'job', 'rank'], dtype='object')

# how to list all datatypes of data frame

In [35]:
df.dtypes

name    object
job     object
rank    object
dtype: object

In [44]:
df

  name             job rank
0    a  data scientist    A
1    b       developer    B
2    c          tester    C

In [45]:
# access rows based on index

In [66]:
print(df.loc[0])
# 1st row based on its index

name                 a
job     data scientist
rank                 A
Name: 0, dtype: object

In [67]:
print(df.loc[1])
# 2nd row based on its index

name            b
job     developer
rank            B
Name: 1, dtype: object

In [52]:
data

{'name': ['a', 'b', 'c'],
 'job': ['data scientist', 'developer', 'tester'],
 'rank': ['A', 'B', 'C']}

# Set particular column as index

In [71]:
df.set_index("name")
# you can pass multiple column values as list inside set index method

                 job rank
name
a     data scientist    A
b          developer    B
c             tester    C

In [85]:
# or you can set labeled index when create data frame

In [77]:
df3=pd.DataFrame(data,index=["x","y","z"])
df3

  name             job rank
x    a  data scientist    A
y    b       developer    B
z    c          tester    C

# diff b/w loc and iloc :

In [78]:
df3

  name             job rank
x    a  data scientist    A
y    b       developer    B
z    c          tester    C

In [80]:
df

  name             job rank
0    a  data scientist    A
1    b       developer    B
2    c          tester    C

In [81]:
df.loc[0]

name                 a
job     data scientist
rank                 A
Name: 0, dtype: object

In [84]:
df3.loc["x"]

name                 a
job     data scientist
rank                 A
Name: x, dtype: object

In [89]:
df.iloc[0]
# using iloc we can only get inbuild index not labeled index

name                 a
job     data scientist
rank                 A
Name: 0, dtype: object

In [90]:
df3.iloc["x"]

TypeError: Cannot index by location index with a non-integer key

In [91]:
df3.iloc[0]

name                 a
job     data scientist
rank                 A
Name: x, dtype: object

In [92]:
# how to access particular row value in particular column

In [93]:
df3
# here if i want to get job of b means ;

  name             job rank
x    a  data scientist    A
y    b       developer    B
z    c          tester    C

In [96]:
df3["job"]["y"]
# we can get like this

'developer'